YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
// 渐进式图传状态：整帧缓存在 PSRAM，按驱动队列空闲逐分片续传，队列满即停、下 tick 再续，
// 直到整帧发完才抓下一帧。链路能承受多少就稳发多少(自然降帧)，不再出现"整帧发一半被弃"——
// 半帧到手机端必然重组不出来，那些字节纯属白占链路，还会把接收端卡在旧画面上。
// 帧率天然自适应：吞吐 ÷ 单帧字节，无需调参；代价是慢链路下画面变陈旧，故设上限弃帧重来。
#define OUT_FRAME_MAX_US   600000  // 单帧在途时长上限(us)：超时弃帧，避免画面无限陈旧
#define OUT_FRAME_STALL_US 400000  // 连续此期间一个分片都发不出去 → 判链路死，弃帧重试
static uint8_t* s_out_jpeg = nullptr;  // 当前待发帧副本(PSRAM)
static size_t   s_out_cap = 0;         // s_out_jpeg 已分配容量
static size_t   s_out_len = 0;         // 本帧字节数
static uint16_t s_out_count = 0;       // 本帧分片总数
static uint16_t s_out_seq_next = 0;    // 下一个待发分片序号
static uint32_t s_out_fid = 0;         // 本帧号
static bool     s_out_active = false;  // 有帧在续传中
static uint64_t s_out_start = 0;       // 本帧开始续传时刻(us)
// 最近一次成功发出分片的时刻(us)。弃帧判据用它而非"tick 计数"：慢链路上帧尾会把驱动
// 缓冲池占满，新帧开头几拍可能一片都发不出去，按 tick 数判会把这些帧误杀。
static uint64_t s_out_last_ok = 0;
static uint64_t s_out_last_grab_us = 0;  // 上帧开抓时刻(us)，用于上限帧率节流
// 弃帧时的背压归因：sendto 失败原因(errno)与本帧累计失败次数。ENOBUFS=驱动 TX 池满(对端/空口不消化)、
// EAGAIN=本端 socket 发送缓冲满、其余多为 netif 异常 —— 三者处置完全不同，故随弃帧一并印出，
// 免得只能从"无进展多少 ms"反推。（空口不消化时池子被在途包占满，重试再多次也发不出去。）
static int      s_out_errno = 0;
static uint32_t s_out_fail = 0;

static void udp_peer_clear(void) {
    s_udp_peer_valid = false;
    s_out_active = false;
}

static void udp_out_free(void) {
    if (s_out_jpeg) { heap_caps_free(s_out_jpeg); s_out_jpeg = nullptr; s_out_cap = 0; }
}

// 把一帧 JPEG 拷入 PSRAM 副本作为"当前待发帧"，随后由 udp_pump() 逐分片续传。
static bool udp_start_frame(const uint8_t *jpeg, size_t len) {
    if (!len || len > 256 * 1024) return false;
    if (!s_out_jpeg || len > s_out_cap) {
        uint8_t *nb = (uint8_t*)heap_caps_malloc(len, MALLOC_CAP_SPIRAM);
        if (!nb) return false;
        udp_out_free();
        s_out_jpeg = nb; s_out_cap = len;
    }
    memcpy(s_out_jpeg, jpeg, len);
    s_out_len = len;
    s_out_count = (uint16_t)((len + UDP_JPG_CHUNK - 1) / UDP_JPG_CHUNK);
    s_out_fid = s_udp_frame_id++;
    s_out_seq_next = 0;
    s_out_start = esp_timer_get_time();
    s_out_last_ok = s_out_start;   // 从"刚起步"起算无进展时长
    s_out_errno = 0;
    s_out_fail = 0;
    s_out_active = true;
    return true;
}

// 单 tick 内续传的时间预算：队列满时让出片刻等驱动排空再续。
// ⚠️ 撞满不能立刻收手：WiFi 驱动的 TX 缓冲池只有十几个 buffer(~24KB)，每 tick 只填满一次的话，
// 吞吐会被钉死在「池容量 × 循环频率」≈ 240KB/s，远低于链路实际能力（单帧 >60KB 时只剩几帧）；
// 预算到期才收手，剩余分片交给下一 tick，既解开自设上限又不霸占本任务。
#define OUT_PUMP_BUDGET_US 40000
// 推流时的循环节拍(ms)。这个延时在每轮循环末尾无条件执行，而一帧通常要跨多轮 pump 才发完，
// 于是它既是「每帧固定多付的延迟」，也是「帧间隔被量化的台阶」（帧率忽高忽低的一部分来源）。
// 取 5ms：远小于一帧的空中时间，兼顾"队列一空就赶紧续片"与"不空转烧 CPU"。
// （pump 自身已按 40ms 预算与队列状态自行限流，不靠这个节拍限速。）
#define OUT_PUMP_TICK_MS   5

// 续传当前帧：按底层队列空闲连续发送分片；整帧发完置 s_out_active=false。
// lwip 的 UDP 出站没有发送队列，sendto 失败反映的是 WiFi 驱动 TX 队列满 —— 属背压而非错误，
// 因此绝不据此废弃整帧（旧实现 break 后整帧丢弃，是"帧一直被丢弃"的直接原因）。
// 帧率自适应为「吞吐 ÷ 单帧字节」，无需调参。
static void udp_pump(void) {
    if (!s_out_active || !s_udp_peer_valid || s_udp_fd < 0) return;
    uint8_t hdr[UDP_FRAME_HDR];
    uint8_t buf[UDP_JPG_CHUNK + UDP_FRAME_HDR];
    uint64_t t0 = esp_timer_get_time();
    while (s_out_seq_next < s_out_count) {
        size_t off = (size_t)s_out_seq_next * UDP_JPG_CHUNK;
        size_t chunk = s_out_len - off;
        if (chunk > UDP_JPG_CHUNK) chunk = UDP_JPG_CHUNK;
        uint16_t seq = s_out_seq_next;
        hdr[0] = UDP_MAGIC0; hdr[1] = UDP_MAGIC1;
        hdr[2] = (uint8_t)(s_out_fid >> 24); hdr[3] = (uint8_t)(s_out_fid >> 16);
        hdr[4] = (uint8_t)(s_out_fid >> 8);  hdr[5] = (uint8_t)(s_out_fid);
        hdr[6] = (uint8_t)(seq >> 8);        hdr[7] = (uint8_t)(seq);
        hdr[8] = (uint8_t)(s_out_count >> 8); hdr[9] = (uint8_t)(s_out_count);
        hdr[10] = (uint8_t)(s_out_len >> 24); hdr[11] = (uint8_t)(s_out_len >> 16);
        hdr[12] = (uint8_t)(s_out_len >> 8);  hdr[13] = (uint8_t)(s_out_len);
        memcpy(buf, hdr, UDP_FRAME_HDR);
        memcpy(buf + UDP_FRAME_HDR, s_out_jpeg + off, chunk);
        if (lwip_sendto(s_udp_fd, buf, UDP_FRAME_HDR + chunk, 0,
                        (struct sockaddr *)&s_udp_peer, sizeof(s_udp_peer)) < 0) {
            s_out_errno = errno;  // 归因用（见 s_out_errno 注释）
            s_out_fail++;
            if (esp_timer_get_time() - t0 >= OUT_PUMP_BUDGET_US) break;  // 本 tick 预算用尽，余片下 tick 续
            vTaskDelay(1);  // 让出约 1ms 给驱动排空，同一分片稍后重试
            continue;
        }
        s_out_last_ok = esp_timer_get_time();
        s_out_seq_next++;
    }
    if (s_out_seq_next >= s_out_count) s_out_active = false;  // 整帧发完
}

// 全量 WS fd 探测/踢除辅助：httpd 仅暴露活跃 fd 表，无 per-fd 状态管理，故按需遍历。
static esp_err_t ws_send_text(int fd, const char *text);  // 前向声明（定义在下方）
static void ws_ping_all(void) {
    int fds[WS_MAX_CLIENTS]; size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        ws_send_text(fds[i], "{\"type\":\"ping\"}");  // 探测帧，对端回 pong
    }
}

static void ws_kick_all(void) {
    int fds[WS_MAX_CLIENTS]; size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        httpd_sess_trigger_close(stream_httpd, fds[i]);  // 关闭死 fd，下轮剔出 client list
    }
}

// WS 文本统一出口消毒(残缺/非法 UTF-8 与控制字符→'?')，防 Godot 1007 断链
static void ws_sanitize_utf8(char* s) {
    char* w = s;
    const unsigned char* p = (const unsigned char*)s;
    while (*p) {
        unsigned char c = *p;
        int need = 0;
        if (c < 0x20 || c == 0x7f) { *w++ = '?'; p++; continue; }
        if (c < 0x80) { *w++ = (char)c; p++; continue; }
        if (c >= 0xC2 && c <= 0xDF) need = 1;
        else if (c >= 0xE0 && c <= 0xEF) need = 2;
        else if (c >= 0xF0 && c <= 0xF4) need = 3;
        bool ok = need > 0;
        for (int i = 1; ok && i <= need; i++) {
            unsigned char cc = p[i];
            if (!cc || !(cc >= 0x80 && cc <= 0xBF)) ok = false;
        }
        if (ok) { for (int i = 0; i <= need; i++) *w++ = (char)p[i]; p += need + 1; }
        else    { *w++ = '?'; p += 1; }
    }
    *w = 0;
}

static esp_err_t ws_send_text(int fd, const char *text)
{
    // 统一出口消毒，堆拷贝发(1:1)，不动入参、不占发送任务大栈
    size_t n = strlen(text);
    char* buf = (char*)malloc(n + 1);
    if (!buf) return ESP_ERR_NO_MEM;
    memcpy(buf, text, n + 1);
    ws_sanitize_utf8(buf);
    httpd_ws_frame_t frame = {0};
    frame.type = HTTPD_WS_TYPE_TEXT;
    frame.payload = (uint8_t *)buf;
    frame.len = strlen(buf);
    esp_err_t r = httpd_ws_send_frame_async(stream_httpd, fd, &frame);
    free(buf);
    return r;
}

static esp_err_t ws_send_jpeg(int fd, camera_fb_t *fb)
{
    httpd_ws_frame_t frame = {0};
    frame.type = HTTPD_WS_TYPE_BINARY;
    frame.payload = fb->buf;
    frame.len = fb->len;
    return httpd_ws_send_frame_async(stream_httpd, fd, &frame);
}

