YangQwQ/Stm32VisionSenseCar/Stm32-Vision/src/net/app_httpd.cpp
// cmd::Reply 适配：把应答文本发回给指定 fd
static void ws_cmd_reply(void *ctx, const char *text)
{
    int fd = *(int *)ctx;
    ws_send_text(fd, text);
}

// 文本帧 = 指令 JSON；stream 就地建/拆 UDP 会话，其余统一移交 command 模块
static void ws_handle_text(const char *json, int fd)
{
    JsonDocument doc;
    if (deserializeJson(doc, json)) {
        log_w("[ws] bad json: %s", json);
        return;
    }
    const char *type = doc["type"] | "";

    // UDP 图传握手：stream on 且携带有效 udp_port → 结合 WS 对端 IP 建立 UDP 会话；
    // 其余（on 无有效端口 / off）→ 拆除旧会话，避免向已失效端口空推。
    if (!strcmp(type, "stream")) {
        bool on = doc["params"]["on"] | false;
        int port = doc["params"]["udp_port"] | 0;
        const char *src_ip = doc["params"]["src_ip"] | "";
        blog::logf(blog::WS, "stream on=%d port=%d src_ip=%s", on, port, src_ip);
        if (on && port > 0) {
            struct sockaddr_in src;
            socklen_t sl = sizeof(src);
            uint32_t peer_ip = 0;
            // 优先采用手机上报的本机 IP（实测 lwip_getpeername 对 httpd fd 回 0.0.0.0，不可靠）
            if (src_ip[0]) {
                uint32_t a = 0, b = 0, c = 0, d = 0;
                if (sscanf(src_ip, "%u.%u.%u.%u", &a, &b, &c, &d) == 4)
                    peer_ip = a | (b << 8) | (c << 16) | ((uint32_t)d << 24);  // 首字节在低址 = 网络字节序
                else
                    peer_ip = 0;
            }
            if (peer_ip) {
                udp_peer_set(peer_ip, (uint16_t)port);
            } else if (lwip_getpeername(fd, (struct sockaddr *)&src, &sl) == 0) {
                udp_peer_set(src.sin_addr.s_addr, (uint16_t)port);
            }
            blog::logf(blog::WS, "peer set -> %u.%u.%u.%u:%d",
                        (uint8_t)(peer_ip), (uint8_t)(peer_ip >> 8),
                        (uint8_t)(peer_ip >> 16), (uint8_t)(peer_ip >> 24), port);
        } else {
            udp_peer_clear();
            blog::logf(blog::WS, "peer cleared (on=%d port=%d)", on, port);
        }
    }
    // 统一词表：move/stop/arm/config/stream/ai_goal/ai_cancel 等交给 command
    // （stream 由 command 更新全局图传开关；ai_goal 异步结果回传）。
    // 摇杆高频帧同指令连续重复时只记首条，避免刷屏；换指令再记。
    // has_frames=false：图传已走 UDP，WS 文本帧不内嵌 JPEG（该参数仅用于日志）。
    static String s_last_cmd;
    if (s_last_cmd != type) {
        log_i("[ws] forward to cmd: %s", type);
        s_last_cmd = type;
    }
    cmd::handle(json, false, ws_cmd_reply, &fd);
}

static esp_err_t ws_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        // 非 WS 升级的浏览器访问根路径 → 重定向到 /stream
        if (httpd_req_get_hdr_value_len(req, "Upgrade") == 0) {
            httpd_resp_set_status(req, "302 Found");
            httpd_resp_set_hdr(req, "Location", "/stream");
            httpd_resp_send(req, NULL, 0);
            return ESP_OK;
        }
        tune_socket(httpd_req_to_sockfd(req)); // WS 握手 fd，图传前先调好窗口/Nagle
        return ESP_OK; // WS 握手，101 由 httpd 自动完成
    }

    httpd_ws_frame_t pkt = {0};
    pkt.type = HTTPD_WS_TYPE_TEXT;
    esp_err_t ret = httpd_ws_recv_frame(req, &pkt, 0);
    if (ret != ESP_OK) return ret;
    if (pkt.len == 0) return ESP_OK;
    s_ws_last_rx_ms = (uint32_t)(esp_timer_get_time() / 1000);  // 任何上行都视为有活动，续活判定准
    s_ws_ping_pending = false;                                   // 收到上行即撤销探测等待，防误杀

    // 二进制帧 = 编辑图（裸 JPEG，手机→板）：覆盖暂存供 ai_goal{use_image}消费。
    if (pkt.type == HTTPD_WS_TYPE_BINARY) {
        if (pkt.len > WS_EDIT_IMG_MAX) return ESP_FAIL;  // 超大帧，断开
        char *ibuf = (char *)malloc(pkt.len);
        if (!ibuf) return ESP_ERR_NO_MEM;
        pkt.payload = (uint8_t *)ibuf;
        ret = httpd_ws_recv_frame(req, &pkt, pkt.len);
        if (ret == ESP_OK && pkt.type == HTTPD_WS_TYPE_BINARY) {
            ai::set_edited_image((uint8_t *)ibuf, pkt.len);
        }
        free(ibuf);
        return ret;
    }

    // 文本帧 = 指令 JSON（≤512B，异常长帧断开）
    if (pkt.len > 512) return ESP_FAIL;
    char *buf = (char *)malloc(pkt.len + 1);
    if (!buf) return ESP_ERR_NO_MEM;
    pkt.payload = (uint8_t *)buf;
    ret = httpd_ws_recv_frame(req, &pkt, pkt.len);
    if (ret == ESP_OK && pkt.type == HTTPD_WS_TYPE_TEXT) {
        buf[pkt.len] = 0;
        ws_handle_text(buf, httpd_req_to_sockfd(req));
    }
    free(buf);
    return ret;
}

// core 3.x / IDF 无 httpd_ws_client_iterate：改由 httpd_get_client_list 取全部活跃
// fd，再用 httpd_ws_get_fd_info 筛出 WEBSOCKET 会话（HTTP 会话不计入）。

static bool ws_send_jpeg_to_ws_clients(camera_fb_t *fb, bool *has_client)
{
    bool any = false;
    int fds[WS_MAX_CLIENTS];
    size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return false;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        any = true;
        if (has_client) *has_client = true;
        if (fb) ws_send_jpeg(fds[i], fb);
    }
    return any;
}

// 文本广播给全部 WS 客户端（本直驱状态推送，async 安全）。
static void ws_send_text_to_ws_clients(const char *text)
{
    int fds[WS_MAX_CLIENTS];
    size_t n = WS_MAX_CLIENTS;
    if (httpd_get_client_list(stream_httpd, &n, fds) != ESP_OK) return;
    for (size_t i = 0; i < n; i++) {
        if (httpd_ws_get_fd_info(stream_httpd, fds[i]) != HTTPD_WS_CLIENT_WEBSOCKET) continue;
        ws_send_text(fds[i], text);
    }
}

// 统一日志模块的转发器：WS 广播 + BLE status 通知（在 blog 转发任务线程执行）。
// 由 startCameraServer 注册，供 blog::logf 排队后统一发手机。
static void send_log_to_phone(const char *json)
{
    ws_send_text_to_ws_clients(json);
    ble::send_status(json);
}

// 图传推流任务：stream 开启时按帧率向所有 WS 客户端推 JPEG 帧；
// 同时探测 WS 客户端存在性喂给 ble::set_ws_connected（status.ws），并做对端活体探测：
// 连续 WS_IDLE_PING_MS 无上行 → 发探测 ping；再 WS_PING_TIMEOUT_MS 无任意上行 → 判死，
// 踢掉全部 WS fd 并恢复 BLE 广播（供再次配网/兜底）。assume 单手机客户端（全局 last_rx）。
static void ws_stream_task(void *arg)
{
    while (true) {
        bool has_client = false;
        // WS 客户端在位探测：必须每个 tick 无条件执行。它是 has_client 的唯一来源，
        // 而 has_client 既喂 ble::set_ws_connected，又决定下面「客户端离线」的判定。
        // ⚠️ 曾经只在"抓到新帧"分支里探测：续传跨 tick 那几拍 has_client 恒为 false，
        // 于是刚开播就被判成客户端离线 → 停推流 + 清 UDP 对端（画面卡在首帧、连接显示掉线）。
        ws_send_jpeg_to_ws_clients(nullptr, &has_client);

        if (cmd::streaming()) {
            if (s_out_active) {
                udp_pump();              // 上一帧还在续传：按队列空闲续片，不抢新帧
                // 弃帧只针对"发不动"：链路彻底不消化(持续一段时间一片都没出去)，
                // 或单帧拖太久(超过在途上限，画面已陈旧到没意义)。慢链路只要有进展就不会被弃——
                // 帧率自适应到吞吐，而不是把帧丢一半。
                uint64_t now_us = esp_timer_get_time();
                bool stall    = (now_us - s_out_last_ok > OUT_FRAME_STALL_US);
                bool overtime = (now_us - s_out_start   > OUT_FRAME_MAX_US);
                if (s_out_active && (stall || overtime)) {
                    // 必须打印命中的是哪条判据：超时弃帧时"无进展"往往远小于其阈值(400ms)，
                    // 只印它会把排查方向带偏（曾据此误判链路无进展）。
                    blog::logf(blog::WS, "[udp] 弃帧 fid=%u seq=%u/%u len=%u 判据=%s 无进展=%dms 在途=%dms errno=%d 失败=%u",
                               s_out_fid, s_out_seq_next, s_out_count, (unsigned)s_out_len,
                               stall ? "无进展" : "在途超时",
                               (int)((now_us - s_out_last_ok) / 1000),
                               (int)((now_us - s_out_start) / 1000),
                               s_out_errno, (unsigned)s_out_fail);
                    s_out_active = false;
                }
            } else {
                // 上限帧率：整帧间隔不小于 1/UDP_STREAM_MAX_FPS。不封顶则"链路能推多快推多快"，
                // 接收端吃不下只会积压成延迟，反过来挤占控制面（pong 应答）的时序。
                uint64_t grab_us = esp_timer_get_time();
                if (grab_us - s_out_last_grab_us >= (1000000ULL / UDP_STREAM_MAX_FPS)) {
                    camera_fb_t *fb = cam::grab();    // 图传高频：直接抓帧，拷入 PSRAM 后立刻还缓冲
                    if (fb) {
                        s_out_last_grab_us = grab_us;
                        size_t flen = fb->len;
                        bool started = udp_start_frame(fb->buf, flen);
                        cam::return_frame(fb);
                        if (started) udp_pump();
                    }
                }
            }
        } else {
            // 停推流：中断在途帧并释放 PSRAM 帧副本（下次开播重新分配）
            s_out_active = false;
            udp_out_free();
        }

        uint32_t now = (uint32_t)(esp_timer_get_time() / 1000);
        if (has_client) {
            if (s_ws_last_rx_ms == 0) s_ws_last_rx_ms = now;  // 首个挂上的时刻作为 idle 起点
            if (!s_ws_ping_pending && (int32_t)(now - s_ws_last_rx_ms) >= (int32_t)WS_IDLE_PING_MS) {
                s_ws_ping_pending = true;
                s_ws_ping_at_ms = now;
                s_ws_ping_try = 1;
                ws_ping_all();
                blog::logf(blog::WS, "idle 超时，发探测 ping (#%u)", (unsigned)s_ws_ping_try);
            } else if (s_ws_ping_pending &&
                       (int32_t)(now - s_ws_ping_at_ms) >= (int32_t)WS_PING_TIMEOUT_MS) {
                // 单轮无应答不立刻判死：手机主线程可能只是这一拍被图传解码占住（同步解码、
                // 与 WS 读包同线程），重发一轮给它机会；连续多轮都没上行才认定真断。
                if (s_ws_ping_try >= WS_PING_MAX_TRY) {
                    // 判死：踢 fd，下轮 has_client 回落 → 尾部恢复广播
                    s_ws_ping_pending = false;
                    s_ws_ping_try = 0;
                    s_ws_last_rx_ms = 0;
                    has_client = false;
                    ws_kick_all();
                    blog::logf(blog::WS, "探测 %u 轮无应答，判定断线，恢复广播", (unsigned)WS_PING_MAX_TRY);
                } else {
                    s_ws_ping_at_ms = now;
                    s_ws_ping_try++;
                    ws_ping_all();
                    blog::logf(blog::WS, "探测无应答，重发 ping (#%u/%u)",
                               (unsigned)s_ws_ping_try, (unsigned)WS_PING_MAX_TRY);
                }
            }
        } else {
            s_ws_ping_pending = false;  // 无 WS 挂载时复位探测态
            s_ws_ping_try = 0;
        }

        // 客户端从有到无（手机退出且未先发 stream off）：停掉它发起的推流，
        // 否则 ws 任务持续白抓帧，BLE 广播也无机会恢复。
        if (has_client) {
            s_ws_had_client = true;
        } else if (s_ws_had_client) {
            s_ws_had_client = false;
            cmd::set_streaming(false);
            udp_peer_clear();  // WS 会话失效，随普通图传一起停掉 UDP 对端
            blog::logf(blog::WS, "客户端离线，停止推流");
        }

        ble::set_ws_connected(has_client);
        // 本地直驱状态 → 手机（/log exec on 开启时实时推送；替代原执行板上行帧镜像）。
        // 不依赖 WS 客户端在位：纯蓝牙（WS 未连）时经 BLE status 通知也可直达手机。
        // 默认关：空闲不刷屏。开启后约 400ms 推一条 exec::read_state 合成的状态文本；
        // 状态文本与上次完全相同时跳过（防刷屏，只有变化才推）。
        static uint32_t s_last_status_ms = 0;
        static char s_last_state[192] = {0};
        if (blog::enabled(blog::EXEC) &&
            (int32_t)(now - s_last_status_ms) >= (int32_t)400) {
            s_last_status_ms = now;
            char st[192];  // 状态含抓手前端 XZ 与 PWM + 不可达诊断，需足量避免截断
            if (exec::read_state(st, sizeof(st)) && strcmp(st, s_last_state)) {
                strncpy(s_last_state, st, sizeof(s_last_state) - 1);
                s_last_state[sizeof(s_last_state) - 1] = 0;
                JsonDocument sdoc;
                sdoc["type"] = "exec_status";
                JsonObject sp = sdoc["params"].to<JsonObject>();
                sp["text"] = st;
                String js;
                serializeJson(sdoc, js);
                if (has_client) ws_send_text_to_ws_clients(js.c_str());
                ble::send_status(js.c_str());
            }
        }
        // 图传已改走 UDP：WS 客户端在位仅作指令/状态通道，几乎不占射频；
        // 只有"真在推帧"（UDP 图传 / MJPEG 推流）才停 BLE 广播，否则手机随时可发现
        // VisionS3 重连（此前 WS 常挂/半开会让广播永久关闭，导致手机不重启连不上）。
        ble::set_transmission(isStreaming || cmd::streaming());
        // 空转降频：无 WS 客户端且非推流时，此任务只需维持 BLE 广播/心跳探测，无需高频轮询。
        // 降低空转 CPU，让 core1 让给图传/AI。
        // 推流中用短节拍：udp_pump 已按驱动队列排空速度自行限流，这里只需尽快回到 pump；
        // 若仍用 100ms 长节拍，吞吐会再被钉在「驱动队列容量 × 10Hz」上（见 udp_pump 注释）。
        if (cmd::streaming())
            vTaskDelay(pdMS_TO_TICKS(OUT_PUMP_TICK_MS));
        else if (has_client)
            vTaskDelay(pdMS_TO_TICKS(1000 / WS_STREAM_FPS));
        else
            vTaskDelay(pdMS_TO_TICKS(500));
    }
}
#endif // CONFIG_HTTPD_WS_SUPPORT

#if CONFIG_ESP_FACE_DETECT_ENABLED

